var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "HAL101010",
    sex: "男",
    age: "21",
    phone: "不详",
    email: "3218497724@qq.com",
    address: "江苏南京",
    qq: "不详",
    // log: "明前奶绿",
    excpect_work: "实习工程师",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "祝你：早安，午安，晚安。",
        "关注明前奶绿喵，关注明前奶绿谢谢喵",
        "总是学不会",
        "希望会有好结果，拜托。",
        "明日待我！",
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "前端好难啊，可以不写吗<br>" +
             "你好，我是HAL101010<br>" +
             "很高兴见到你!祝你早安，午安，晚安！",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>南京林业大学20级在读学生，正在学习JAVAEE。</p>"+
           "<p>其他</p>"+
           "<ul>"+
           "<li>常用IDE：vscode/IDEA</li>"+
           "<li>最近在自学nodejs,想积累一点前端经验</li>"+
           "<li>爱好：看管人(Vtuber)</li>"+
           "<li>备考雅思中</li>"+
           "</ul>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Java", 70, "red"],
        ["javascript", 65, "yellow"],
        ["html", 65, "rgba(0,0,100)"],
        ["css", 60, "#66ccff"],
        ["SQL", 40, "green"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>掌握java基本语法，熟悉常用api、集合、多线程。</li>" +
        "     <li>掌握基本数据结构和相关算法。</li>" +
        "     <li>掌握基本增删查改的SQL语句。</li>" +
        "     <li>熟悉SpringBoot、MyBatis等常用框架。</li>" +
        "     <li>了解单例模式、观察者模式等常用设计模式</li>" +
        "     <li>了解linux常用命令</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/sorry.jpg","","暂无作品","sorry"],
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [

    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}